import numpy as np

# 双目相机参数
class stereoCamera(object):
    def __init__(self):
        # 左相机内参
        self.cam_matrix_left = np.array([   [2285.1493,    0.8089, 673.0119],
                                            [        0, 2279.5965, 332.7581],
                                            [        0,         0,        1]
                                        ])
        
        # 右相机内参
        self.cam_matrix_right = np.array([  [2267.2542,   2.0528, 700.6811],
                                            [        0, 2263.8369, 342.9165],
                                            [        0,         0,        1]
                                        ])

        # 左右相机畸变系数:[k1, k2, p1, p2, k3]
        self.distortion_l = np.array([[-0.4602, -1.2288, 0.0032, -0.0096, 0]])
        self.distortion_r = np.array([[-0.4990, -0.1199, 0.0048,    -0.0118, 0]])

        # 旋转矩阵
        self.R = np.array([ [ 1.0000,  0.0010, -0.0016],
                            [-0.0010,  1.0000,  0.0010],
                            [ 0.0016, -0.0010,  1.0000]   
                            ])
        # 平移矩阵
        self.T = np.array([[-47.1142], [0.3251], [-0.3939]])

        # 焦距
        self.focal_length = 2289.9361 # 默认值，一般取立体校正后的重投影矩阵Q中的 Q[2,3]  

        # 基线距离
        self.baseline = 47.1142 # 单位：mm， 为平移向量的第一个参数（取绝对值）


# class stereoCamera(object):
#     def __init__(self):
#         # 左相机内参
#         self.cam_matrix_left = np.array([   [2068.8887,    0.7513, 625.7692],
#                                             [        0, 2069.3238, 346.2614],
#                                             [        0,         0,        1]
#                                         ])
#         # 右相机内参
#         self.cam_matrix_right = np.array([  [2065.1721,   -0.1055, 665.4988],
#                                             [        0, 2065.0975, 353.2808],
#                                             [        0,         0,        1]
#                                         ])

#         # 左右相机畸变系数:[k1, k2, p1, p2, k3]
#         self.distortion_l = np.array([[-0.3609, -0.9251, 0.0011, -0.0024, 12.4238]])
#         self.distortion_r = np.array([[-0.5054, 3.8972, -0.0006333, -0.0004066, -32.1748]])

#         # 旋转矩阵
#         self.R = np.array([ [ 1.0000,  0.0019, -0.0088],
#                             [-0.0019,  1.0000,  0.0014],
#                             [ 0.0088, -0.0014,  1.0000]   
#                             ])

#         # 平移矩阵
#         self.T = np.array([[-65.0633], [0.1298], [1.8620]])

#         # 焦距
#         self.focal_length = 2088.2669 # 默认值，一般取立体校正后的重投影矩阵Q中的 Q[2,3]  

#         # 基线距离
#         self.baseline = 65.0633 # 单位：mm， 为平移向量的第一个参数（取绝对值）